# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azuread_application.kv_sp: Reading...
data.azuread_application.kv_sp: Read complete after 0s [id=/applications/c28691c7-9899-4e43-8292-86b99b0ed3d8]
data.azuread_service_principal.aks_sp: Reading...
data.azuread_service_principal.aks_sp: Read complete after 0s [id=/servicePrincipals/624533ce-2ca8-47a9-886d-6e667defc442]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cdn_frontdoor_custom_domain.authz_domain will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "authz_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "digitaltdodsbo.tt02.altinn.no"
      + id                       = (known after apply)
      + name                     = "authzdigitaltdodsbotest"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "digdir-dd-test-authz"
    }

  # azurerm_cdn_frontdoor_origin.app_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "app_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = "oed-test-authz-app.azurewebsites.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "oed-appservice-origin-test"
      + origin_host_header             = "oed-test-authz-app.azurewebsites.net"
      + priority                       = 1
      + weight                         = 500
    }

  # azurerm_cdn_frontdoor_origin_group.origin_group will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "oed-origin-group-test"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # azurerm_cdn_frontdoor_profile.fd_profile will be created
  + resource "azurerm_cdn_frontdoor_profile" "fd_profile" {
      + id                       = (known after apply)
      + name                     = "oed-fd-profile-test"
      + resource_group_name      = "altinn-digdir-oed-tt02-rg"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
    }

  # azurerm_cdn_frontdoor_route.route will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = (known after apply)
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = true
      + name                            = "default-route-test"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # azurerm_key_vault_secret.admin_app_client_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "admin_app_client_secret" {
      ~ expiration_date         = "2027-06-18T14:16:25Z" -> "2027-06-18T14:16:25.3694326Z"
        id                      = "https://oed-kv.vault.azure.net/secrets/dd-admin-app-client-secret/fea13654767041a1af90e5033b057e77"
        name                    = "dd-admin-app-client-secret"
      ~ not_before_date         = "2025-06-18T14:16:25Z" -> "2025-06-18T14:16:25.3694326Z"
        tags                    = {}
        # (8 unchanged attributes hidden)
    }

  # azurerm_monitor_diagnostic_setting.fd_logs will be created
  + resource "azurerm_monitor_diagnostic_setting" "fd_logs" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/Workspace-altinnapps-digdir-oed-tt02-rg-WEU"
      + name                           = "frontdoor-logs"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "FrontdoorAccessLog"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }

      + metric (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ frontdoor_cname_target             = "digdir-dd-test-authz-dgczfrbqf7f5buav.a01.azurefd.net" -> (known after apply)
  ~ frontdoor_dns_validation_txt_value = "_xv773qcjh6fj3w6b3kwisayxgk6k6eu" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan` |